app/controllers/advertisements_controller.rb

SELECT "advertisements".* FROM "advertisements"
---
  def index
    @advertisements = Advertisement.all

SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @advertisement = Advertisement.find(params[:id])

SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @advertisement = Advertisement.find(params[:id])

INSERT INTO "advertisements" ("created_at", "descripcion", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @advertisement = Advertisement.new(params[:advertisement])

    respond_to do |format|
      if @advertisement.save

SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "advertisements" SET "photo_file_name" = 'prom.jpg', "photo_file_size" = 104417, "photo_updated_at" = '2013-04-11 22:09:55.530443', "updated_at" = '2013-04-11 22:09:57.493136' WHERE "advertisements"."id" = 2
---
  def update
    @advertisement = Advertisement.find(params[:id])

    respond_to do |format|
      if @advertisement.update_attributes(params[:advertisement])