app/controllers/habitaciones_controller.rb

  def index
    @habitaciones = Habitacione.all
---
SELECT "habitaciones".* FROM "habitaciones"