app/controllers/promociones_controller.rb

  def index
  @advertisements = Advertisement.all
---
SELECT "advertisements".* FROM "advertisements"