app/controllers/sessions_controller.rb

def new

  @advertisements = Advertisement.all
---
SELECT "advertisements".* FROM "advertisements"

def create
  @advertisements = Advertisement.all
---
SELECT "advertisements".* FROM "advertisements"